{"modelTopology": {"keras_version": "2.2.2", "training_config": {"loss": "categorical_crossentropy", "optimizer_config": {"class_name": "SGD", "config": {"lr": 0.000699999975040555, "decay": 9.999999974752427e-07, "nesterov": false, "momentum": 0.8999999761581421}}, "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}, "model_config": {"class_name": "Sequential", "config": [{"class_name": "Model", "config": {"layers": [{"name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv1_pad", "config": {"name": "conv1_pad", "data_format": "channels_last", "trainable": false, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1", "config": {"trainable": false, "name": "conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [2, 2], "activation": "linear", "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"name": "conv1_bn", "config": {"momentum": 0.99, "name": "conv1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv1_relu", "config": {"max_value": 6.0, "name": "conv1_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]]}, {"name": "conv_dw_1", "config": {"data_format": "channels_last", "name": "conv_dw_1", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": false, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]]}, {"name": "conv_dw_1_bn", "config": {"momentum": 0.99, "name": "conv_dw_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]]}, {"name": "conv_dw_1_relu", "config": {"max_value": 6.0, "name": "conv_dw_1_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]]}, {"name": "conv_pw_1", "config": {"trainable": false, "name": "conv_pw_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]]}, {"name": "conv_pw_1_bn", "config": {"momentum": 0.99, "name": "conv_pw_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]]}, {"name": "conv_pw_1_relu", "config": {"max_value": 6.0, "name": "conv_pw_1_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]]}, {"name": "conv_pad_2", "config": {"name": "conv_pad_2", "data_format": "channels_last", "trainable": false, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]]}, {"name": "conv_dw_2", "config": {"data_format": "channels_last", "name": "conv_dw_2", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": false, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]]}, {"name": "conv_dw_2_bn", "config": {"momentum": 0.99, "name": "conv_dw_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]]}, {"name": "conv_dw_2_relu", "config": {"max_value": 6.0, "name": "conv_dw_2_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]]}, {"name": "conv_pw_2", "config": {"trainable": false, "name": "conv_pw_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 128, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]]}, {"name": "conv_pw_2_bn", "config": {"momentum": 0.99, "name": "conv_pw_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]]}, {"name": "conv_pw_2_relu", "config": {"max_value": 6.0, "name": "conv_pw_2_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]]}, {"name": "conv_dw_3", "config": {"data_format": "channels_last", "name": "conv_dw_3", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": false, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]]}, {"name": "conv_dw_3_bn", "config": {"momentum": 0.99, "name": "conv_dw_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]]}, {"name": "conv_dw_3_relu", "config": {"max_value": 6.0, "name": "conv_dw_3_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]]}, {"name": "conv_pw_3", "config": {"trainable": false, "name": "conv_pw_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 128, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]]}, {"name": "conv_pw_3_bn", "config": {"momentum": 0.99, "name": "conv_pw_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]]}, {"name": "conv_pw_3_relu", "config": {"max_value": 6.0, "name": "conv_pw_3_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]]}, {"name": "conv_pad_4", "config": {"name": "conv_pad_4", "data_format": "channels_last", "trainable": false, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]]}, {"name": "conv_dw_4", "config": {"data_format": "channels_last", "name": "conv_dw_4", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": false, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]]}, {"name": "conv_dw_4_bn", "config": {"momentum": 0.99, "name": "conv_dw_4_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]]}, {"name": "conv_dw_4_relu", "config": {"max_value": 6.0, "name": "conv_dw_4_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]]}, {"name": "conv_pw_4", "config": {"trainable": false, "name": "conv_pw_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]]}, {"name": "conv_pw_4_bn", "config": {"momentum": 0.99, "name": "conv_pw_4_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]]}, {"name": "conv_pw_4_relu", "config": {"max_value": 6.0, "name": "conv_pw_4_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]]}, {"name": "conv_dw_5", "config": {"data_format": "channels_last", "name": "conv_dw_5", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": false, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]]}, {"name": "conv_dw_5_bn", "config": {"momentum": 0.99, "name": "conv_dw_5_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]]}, {"name": "conv_dw_5_relu", "config": {"max_value": 6.0, "name": "conv_dw_5_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]]}, {"name": "conv_pw_5", "config": {"trainable": false, "name": "conv_pw_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 256, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]]}, {"name": "conv_pw_5_bn", "config": {"momentum": 0.99, "name": "conv_pw_5_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]]}, {"name": "conv_pw_5_relu", "config": {"max_value": 6.0, "name": "conv_pw_5_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]]}, {"name": "conv_pad_6", "config": {"name": "conv_pad_6", "data_format": "channels_last", "trainable": false, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]]}, {"name": "conv_dw_6", "config": {"data_format": "channels_last", "name": "conv_dw_6", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": false, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]]}, {"name": "conv_dw_6_bn", "config": {"momentum": 0.99, "name": "conv_dw_6_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]]}, {"name": "conv_dw_6_relu", "config": {"max_value": 6.0, "name": "conv_dw_6_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]]}, {"name": "conv_pw_6", "config": {"trainable": false, "name": "conv_pw_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 512, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]]}, {"name": "conv_pw_6_bn", "config": {"momentum": 0.99, "name": "conv_pw_6_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]]}, {"name": "conv_pw_6_relu", "config": {"max_value": 6.0, "name": "conv_pw_6_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]]}, {"name": "conv_dw_7", "config": {"data_format": "channels_last", "name": "conv_dw_7", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": false, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]]}, {"name": "conv_dw_7_bn", "config": {"momentum": 0.99, "name": "conv_dw_7_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]]}, {"name": "conv_dw_7_relu", "config": {"max_value": 6.0, "name": "conv_dw_7_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]]}, {"name": "conv_pw_7", "config": {"trainable": false, "name": "conv_pw_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 512, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]]}, {"name": "conv_pw_7_bn", "config": {"momentum": 0.99, "name": "conv_pw_7_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]]}, {"name": "conv_pw_7_relu", "config": {"max_value": 6.0, "name": "conv_pw_7_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]]}, {"name": "conv_dw_8", "config": {"data_format": "channels_last", "name": "conv_dw_8", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": false, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]]}, {"name": "conv_dw_8_bn", "config": {"momentum": 0.99, "name": "conv_dw_8_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]]}, {"name": "conv_dw_8_relu", "config": {"max_value": 6.0, "name": "conv_dw_8_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]]}, {"name": "conv_pw_8", "config": {"trainable": false, "name": "conv_pw_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 512, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]]}, {"name": "conv_pw_8_bn", "config": {"momentum": 0.99, "name": "conv_pw_8_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]]}, {"name": "conv_pw_8_relu", "config": {"max_value": 6.0, "name": "conv_pw_8_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]]}, {"name": "conv_dw_9", "config": {"data_format": "channels_last", "name": "conv_dw_9", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": false, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]]}, {"name": "conv_dw_9_bn", "config": {"momentum": 0.99, "name": "conv_dw_9_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]]}, {"name": "conv_dw_9_relu", "config": {"max_value": 6.0, "name": "conv_dw_9_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]]}, {"name": "conv_pw_9", "config": {"trainable": false, "name": "conv_pw_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 512, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]]}, {"name": "conv_pw_9_bn", "config": {"momentum": 0.99, "name": "conv_pw_9_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]]}, {"name": "conv_pw_9_relu", "config": {"max_value": 6.0, "name": "conv_pw_9_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]]}, {"name": "conv_dw_10", "config": {"data_format": "channels_last", "name": "conv_dw_10", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": false, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]]}, {"name": "conv_dw_10_bn", "config": {"momentum": 0.99, "name": "conv_dw_10_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]]}, {"name": "conv_dw_10_relu", "config": {"max_value": 6.0, "name": "conv_dw_10_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]]}, {"name": "conv_pw_10", "config": {"trainable": false, "name": "conv_pw_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 512, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]]}, {"name": "conv_pw_10_bn", "config": {"momentum": 0.99, "name": "conv_pw_10_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]]}, {"name": "conv_pw_10_relu", "config": {"max_value": 6.0, "name": "conv_pw_10_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]]}, {"name": "conv_dw_11", "config": {"data_format": "channels_last", "name": "conv_dw_11", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": false, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]]}, {"name": "conv_dw_11_bn", "config": {"momentum": 0.99, "name": "conv_dw_11_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]]}, {"name": "conv_dw_11_relu", "config": {"max_value": 6.0, "name": "conv_dw_11_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]]}, {"name": "conv_pw_11", "config": {"trainable": false, "name": "conv_pw_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 512, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]]}, {"name": "conv_pw_11_bn", "config": {"momentum": 0.99, "name": "conv_pw_11_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]]}, {"name": "conv_pw_11_relu", "config": {"max_value": 6.0, "name": "conv_pw_11_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]]}, {"name": "conv_pad_12", "config": {"name": "conv_pad_12", "data_format": "channels_last", "trainable": false, "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]]}, {"name": "conv_dw_12", "config": {"data_format": "channels_last", "name": "conv_dw_12", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [2, 2], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": false, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]]}, {"name": "conv_dw_12_bn", "config": {"momentum": 0.99, "name": "conv_dw_12_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]]}, {"name": "conv_dw_12_relu", "config": {"max_value": 6.0, "name": "conv_dw_12_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]]}, {"name": "conv_pw_12", "config": {"trainable": false, "name": "conv_pw_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 1024, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]]}, {"name": "conv_pw_12_bn", "config": {"momentum": 0.99, "name": "conv_pw_12_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]]}, {"name": "conv_pw_12_relu", "config": {"max_value": 6.0, "name": "conv_pw_12_relu", "trainable": false}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]]}, {"name": "conv_dw_13", "config": {"data_format": "channels_last", "name": "conv_dw_13", "depthwise_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_constraint": null, "use_bias": false, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "depthwise_constraint": null}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]]}, {"name": "conv_dw_13_bn", "config": {"momentum": 0.99, "name": "conv_dw_13_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]]}, {"name": "conv_dw_13_relu", "config": {"max_value": 6.0, "name": "conv_dw_13_relu", "trainable": true}, "class_name": "ReLU", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]]}, {"name": "conv_pw_13", "config": {"trainable": true, "name": "conv_pw_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 1024, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]]}, {"name": "conv_pw_13_bn", "config": {"momentum": 0.99, "name": "conv_pw_13_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]]}, {"name": "conv_pw_13_relu", "config": {"max_value": 6.0, "name": "conv_pw_13_relu", "trainable": true}, "class_name": "ReLU", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]]}], "name": "mobilenet_1.00_224", "input_layers": [["input_1", 0, 0]], "output_layers": [["conv_pw_13_relu", 0, 0]]}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1, 1, 1024]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "activity_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "rate": 0.5, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "activity_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "trainable": true, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "rate": 0.5, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4, "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "softmax", "trainable": true}}]}, "backend": "tensorflow"}, "weightsManifest": [{"weights": [{"name": "batch_normalization_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [1024, 256], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [128, 4], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [4], "dtype": "float32"}, {"name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 1024, 1], "dtype": "float32"}, {"name": "conv_dw_13_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "conv_dw_1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_pw_1/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv_pw_1_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv_dw_2_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_2/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv_pw_2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_3_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv_pw_3_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_4_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_4/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv_pw_4_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_4_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_4_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_4_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_5_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "conv_pw_5_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": 